import { Component, OnInit } from '@angular/core';
import { TranslateService } from '@ngx-translate/core';
import {DataService} from '../data.service';
import {Router} from '@angular/router';

@Component({
  selector: 'app-main',
  templateUrl: './main.component.html',
  styleUrls: ['./main.component.css']
})
export class MainComponent implements OnInit {
  language: number;

  menupanel = false;

  constructor(private translate:TranslateService,private data:DataService,private router:Router) { }

  description_ru = "Эта книга - мой великий сторонник, посвященный моим творческим людям, которые выросли на пути к прекрасному будущему!";
  description_kk = "Бұл кітап менің ұлы қолдаушым, кемел келешегіне өзінің қазақстандық жолымен қарыштаған жасампаз халқыма арналады!";

  modal_text_kk = "Қазақстан Республикасының Президенті Нұрсұлтан Назарбаевтың «Тәуелсіздік дәуірі» атты бұл кітабы тарихи публицистика жанрында жазылған, ол еліміздің жаңа тарихы мен оның ертеңіне деген автордың көзқарасын танытады. Егемен мемлекет- тің негізі қаланған күннен бастап оның қалыптасу кезеңдерінің ерекшеліктері мен 26 жылдық тәуелсіздік дәуіріндегі ішкі және сыртқы сын-қатерлерді еңсеруге байла- нысты қабылданған шешімдердің мән-мазмұны мен тетіктері егжей-тегжейлі баянда- лады.\n" +
    "Кітапта «қазақстандық даму үлгісінің» табиғаты мен оның эволюциясы, басты ұстанымдары мен қозғаушы күштері сараланған. Қазақстанды жаңғыртудың үш толқыны кеңінен ашып көрсетілген. Бірінші және екінші жаңғырту аясында тоталитарлық жүйе- ден түбегейлі ажырап, нарықтық экономиканы құру және бәсекеге барынша қабілетті елу елдің қатарына қосылу міндеті мерзімінен бұрын орындалды. Үшінші жаңғыртудың мақсаты – елімізді қалыптасқан жаңа жаһандық ахуал жағдайында жаңғырта отырып, әлемдегі ең өркенді 30 мемлекеттің қатарына қосу.\n" +
    "«Тәуелсіздік дәуірі» отандық және шетелдік қалың оқырман қауымды қызықты- рар туынды.";

  modal_text_ru = "Эта книга Президента Республики Казахстан Нурсултана Назарбаева «Эпоха независимости» написана в жанре исторической журналистики, что отражает взгляд автора на новую историю страны и ее будущее. Детально описаны особенности этапов его формирования, содержание и механизмы решений, принятых для преодоления внутренних и внешних проблем 26-летнего периода независимости со дня основания суверенного государства.\n" +
    "Книга характеризуется характером «казахстанской модели развития» и ее эволюцией, ее основными принципами и движущими силами. Широко распространены три волны модернизации Казахстана. В рамках первой и второй модернизации задача радикального разделения тоталитарной системы и создания рыночной экономики и присоединения к пятидесяти наиболее конкурентоспособным странам была завершена досрочно. Целью третьей модернизации является включение страны в 30 самых процветающих стран мира в новых глобальных условиях.\n" +
    "«Эпоха независимости» вызвала интерес как отечественных, так и зарубежных читателей.";x

  list_of_periods_ru = [
    {
      year:"1991 - 1995 ж",
      card_text:"ГОСУДАРСТВО НАШЕЙ СТРАНЫ - МИР. ПЕРВАЯ ПОПРАВКА КАЗАХСТАНА",
      distance:0
    },
    {
      year:"1996 - 1999 ж",
      card_text:"НАЧАЛО ВТОРОГО ГЛАВНОГО ВЕЛИКОБРИТАНИИ КАЗАХСТАН",
      distance:6
    },
    {
      year:"2000 - 2010 ж",
      card_text:"ГИДРАВЛИЧЕСКИЙ КРЕМ. ВТОРАЯ НИЖНЯЯ ЧАСТЬ КАЗАХСТАНА",
      distance:13
    },
    {
      year:"2000 ж",
      card_text:"УСТАНОВЛЕННОЕ СОСТОЯНИЕ. ТРЕТИЙ УРОВЕНЬ КАЗАХСТАНА",
      distance:19
    },
  ];

  list_of_periods_kk = [
    {
      year:"1991 - 1995 ж",
      card_text:"МЕМЛЕКЕТІМІЗДІҢ ДҮНИЕГЕ КЕЛУІ. ҚАЗАҚСТАННЫҢ БІРІНШІ ЖАҢҒЫРУЫ",
      distance:0
    },
    {
      year:"1996 - 1999 ж",
      card_text:"ҰЛЫ БЕТБҰРЫC ҚАЗАҚСТАННЫҢ ЕКІНШІ ЖАҢҒЫРУЫНЫҢ БАСТАЛУЫ",
      distance:6
    },
    {
      year:"2000 - 2010 ж",
      card_text:"ҚИЯҒА ҚҰЛАШ СЕРМЕУ. ҚАЗАҚСТАННЫҢ ЕКІНШІ ЖАҢҒЫРУЫ",
      distance:13
    },
    {
      year:"2000 ж",
      card_text:"ҚАЛЫПТАСҚАН МЕМЛЕКЕТ. ҚАЗАҚСТАННЫҢ ҮШІНШІ ЖАҢҒЫРУЫ",
      distance:19
    },
  ];


  ngOnInit() {
    this.checkLang();
  }

  goToCards(period){
    console.log(period);
    this.router.navigateByUrl('cards');
    this.data.showInitialSlide(period);
  }

  checkLang(){
    let lang = localStorage.getItem('lang');
    if(lang == "ru"){
      this.language = 1;
    }
    else{
      this.language = 2;
    }
  }

  changeLang(lang) {
    if(lang == "kk"){
      localStorage.setItem('lang',lang);
      this.translate.setDefaultLang(lang);
      location.reload();
    }
    else{
      localStorage.setItem('lang','ru');
      this.translate.setDefaultLang('ru');
      location.reload();
    }
  }

  showMenu(){
    this.menupanel = !this.menupanel;
  }

}
